/*
旺仔哥哥非常喜欢玩扫雷。现在给定一个初始的扫雷矩阵，其中用字符 `*` 表示雷，用 `.` 表示空白。
请你生成完整的扫雷矩阵。对于每个非雷格子，输出它周围八个方向中雷的个数；如果当前位置是雷，则仍输出 `*`。

【名词解释】
雷: 用 `*` 表示的地雷；
邻格: 与当前位置在八个方向上相邻的格子；
完整扫雷矩阵: 填写完相应数字后的矩阵
*/

/*
方法: 检查格子所在九宫格, 为了检查边角位置的格子, 在矩阵外围加一圈'.'(空白)。
*/

#include <iostream>
using namespace std;
char board[1000][1000];
int main()
{
    int row, col, i, j;
    cin >> row >> col;
    for (i = 0; i < row + 2; i++)
    {
        for (j = 0; j < col + 2; j++)
        {
            if (j == 0 || j == col + 1 || i == 0 || i == row + 1)
            { // 在矩阵外围加一圈'.'(空白)
                board[i][j] = '.';
            }
            else
            {
                cin >> board[i][j];
            }
        }
    }
    for (i = 1; i <= row; i++)
    {
        for (j = 1; j <= col; j++)
        {
            if (board[i][j] == '*')
            {
                cout << '*'; // 如果当前位置是雷，则仍输出 `*`
                continue;
            }
            int m, n, count = 0;
            for (m = i - 1; m < i + 2; m++)
            { // 不是雷, 则检查格子周围九宫格,
                for (n = j - 1; n < j + 2; n++)
                {
                    if (board[m][n] == '*')
                    { // 计数发现雷的数量
                        count++;
                    }
                }
            }
            cout << count;
        }
        cout << endl; // 完成一行后换行
    }
}

/*
测试用例:
4 4
....
..**
*.*.
.*.*

输出:
0122
13**
*4*4
2*3*

*/